; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 873683 2 2 2 7 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	infrared1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	Star4 - direction
	Star1 - direction
	Star6 - direction
	Star3 - direction
	GroundStation5 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(have_image Planet7 spectrograph0)
	(have_image Planet8 spectrograph0)
	(have_image Planet9 infrared1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 3
3. (turn_to satellite0 star1 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star1)
   goals met: 0 of 3
4. (turn_to satellite1 planet9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet9)
   goals met: 0 of 3
5. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 3
6. (turn_to satellite1 planet7 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet7)
   goals met: 0 of 3
7. (turn_to satellite0 planet8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet8)
   goals met: 0 of 3
8. (turn_to satellite1 planet9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet9)
   goals met: 0 of 3
9. (take_image satellite0 planet8 instrument0 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 1 of 3
10. (turn_to satellite1 groundstation5 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 groundstation5)
   goals met: 1 of 3
11. (turn_to satellite0 planet7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet7)
   goals met: 1 of 3
12. (calibrate satellite1 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 1 of 3
13. (take_image satellite0 planet7 instrument0 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 2 of 3
14. (turn_to satellite1 planet9 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 planet9)
   goals met: 2 of 3
15. (take_image satellite1 planet9 instrument2 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 3 of 3
